In [1]:
import pandas as pd

In [3]:
dipl={'teams':['dc','kkr','mi','mi','csk','csk','mi','csk','rcb'],'year':[2008,2009,2010,2012,2011,2010,2012,2009,2012],
     'rank':[1,1,1,2,1,3,3,1,4]}
df_ipl=pd.DataFrame(dipl)
df_ipl

  teams  year  rank
0    dc  2008     1
1   kkr  2009     1
2    mi  2010     1
3    mi  2012     2
4   csk  2011     1
5   csk  2010     3
6    mi  2012     3
7   csk  2009     1
8   rcb  2012     4

In [4]:
dfgroup=df_ipl.groupby('teams')
dfgroup

In [5]:
dfgroup.groups

{'csk': [4, 5, 7], 'dc': [0], 'kkr': [1], 'mi': [2, 3, 6], 'rcb': [8]}

In [6]:
for g in dfgroup.groups:
    print(g)

csk
dc
kkr
mi
rcb

In [10]:
grouped=df_ipl.groupby(['teams','year']).groups

In [11]:
for name,group in grouped:
    print(group)
    print(name)

2009
csk
2010
csk
2011
csk
2008
dc
2009
kkr
2010
mi
2012
mi
2012
rcb

In [12]:
import numpy as np

In [13]:
grouped1=df_ipl.groupby(['teams','year'])

In [14]:
grouped1.get_group(('csk',2011))

  teams  year  rank
4   csk  2011     1

In [15]:
ygroup=df_ipl.groupby(['year'])
ygroup.groups

{2008: [0], 2009: [1, 7], 2010: [2, 5], 2011: [4], 2012: [3, 6, 8]}

In [17]:
ygroup.get_group(2010)
ygroup.groups

{2008: [0], 2009: [1, 7], 2010: [2, 5], 2011: [4], 2012: [3, 6, 8]}

In [18]:
ygroup['rank'].agg(np.sum)

year
2008    1
2009    2
2010    4
2011    1
2012    9
Name: rank, dtype: int64

In [19]:
df_ipl

  teams  year  rank
0    dc  2008     1
1   kkr  2009     1
2    mi  2010     1
3    mi  2012     2
4   csk  2011     1
5   csk  2010     3
6    mi  2012     3
7   csk  2009     1
8   rcb  2012     4

In [20]:
ygroup['rank'].agg([np.sum,np.mean,np.median,np.std])

      sum  mean  median       std
year
2008    1     1       1       NaN
2009    2     1       1  0.000000
2010    4     2       2  1.414214
2011    1     1       1       NaN
2012    9     3       3  1.000000

In [23]:
df_ipl.groupby('teams').filter(lambda x: len(x)<3)

  teams  year  rank
0    dc  2008     1
1   kkr  2009     1
8   rcb  2012     4

In [24]:
df_ipl.groupby('teams').groups

{'csk': [4, 5, 7], 'dc': [0], 'kkr': [1], 'mi': [2, 3, 6], 'rcb': [8]}

In [26]:
df_ipl.groupby('teams').filter(lambda x: len(x)>=3)

  teams  year  rank
2    mi  2010     1
3    mi  2012     2
4   csk  2011     1
5   csk  2010     3
6    mi  2012     3
7   csk  2009     1